      * AllocateMemory
       01 ()-alloc-work.
         03 ()-alloc-local-ptr         pointer value null.
         03 ()-alloc-local-size        pic x(4) comp-5 value 0.
         03 ()-alloc-local-return      pic x(4) comp-5 value 0.
         03 ()-alloc-local-type        pic x(4) comp-5 value 0.