      * ErrorCodes
       01 ()-error-code        pic x comp-x    value 0.
         88 ()-zero-value-88                   value 1.
         88 ()-large-value-88                  value 2.
