      * Fibonacci
       01 ()-fibonacci.
           03 ()-total         pic x(8) comp-x value 0.
           03 ()-prev          pic x(8) comp-x value 0.
           03 ()-curr          pic x(8) comp-x value 1.
           03 ()-temp          pic x(8) comp-x value 0.
           03 ()-index         pic x comp-x value 0.
