      * Node
       78 78-list-max-size     value 100.
       01 ()-node.
         03 ()-prev-node       pointer value null.
         03 ()-next-node       pointer value null.
         03 ()-position        pic x(4) comp-x.
         03 ()-val             pic x.
